Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСоздан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Записан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Счета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьНачальныйОстатокПриИзменении(Элемент)	 
	УстановитьВидимостьДоступностьЭлементов();
	Если НЕ Объект.УстановитьНачальныйОстаток И Объект.НачальныйОстаток <> 0 Тогда 
		ТекстВопроса = "Поле начального остатка не равно нулю. Обнулить начальный остаток счёта?";
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыполенениеПослеОтвета", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.УстановитьНачальныйОстаток И Элементы.НачальныйОстаток.Доступность Тогда 
		Если Объект.НачальныйОстаток = 0 Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Введите значение начального остатка!";
			Сообщение.Поле = "Элементы.НачальныйОстаток";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			Если Модифицированность Тогда
				НовыйДокумент = ?(ЗначениеЗаполнено(Объект.Документ), Объект.Документ, Документы.ВводНачальныхОстатков.СоздатьДокумент());
				Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
					НовыйДокумент.Дата = ТекущаяДата();
					НовыйДокумент.Счет = ТекущийОбъект.Ссылка;
					НовыйДокумент.ИсточникПоступления = ПредопределенноеЗначение("Справочник.ИсточникПоступлений.ВводНачальныхОстатков");
					НовыйДокумент.Комментарий = "Создан при вводе начального остатка в карточке счета";
				КонецЕсли;
				НовыйДокумент.Сумма = Объект.НачальныйОстаток;
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ТекущийОбъект.Документ = НовыйДокумент.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийОбъект.ДатаСоздания = ?(ЗначениеЗаполнено(Объект.ДатаСоздания), Объект.ДатаСоздания, ТекущаяДата());
	ТекущийОбъект.Записан = Истина;
	Элементы.НачальныйОстаток.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	Элементы.НачальныйОстаток.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполенениеПослеОтвета(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		Объект.НачальныйОстаток = 0;
		Элементы.ГруппаВводаОстатка.Видимость = Ложь;
		Элементы.НачальныйОстаток.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.ГруппаВводаОстатка.Видимость = Объект.УстановитьНачальныйОстаток ИЛИ Объект.НачальныйОстаток <> 0;
	Элементы.НачальныйОстаток.Доступность = Объект.УстановитьНачальныйОстаток;
	//Элементы.НачальныйОстаток.Доступность = Объект.Записан;
	//Элементы.УстановитьНачальныйОстаток.Доступность = Объект.Записан;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ, Объект.Ссылка, Элементы.Наименование);
	Если Отказ Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Валюта с таким наименованием уже есть!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(Отказ, Ссылка, Наименование)
	Отказ = ОбщиеПроцедурыИФункцииСервер.ПроверитьНаличиеДубляНаименования(Наименование, "Валюты", Ссылка); 
КонецПроцедуры
